Revit 2027 API
Document.MakeTransientElements Method
 This method encapsulates the process of creating transient elements in the document.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void MakeTransientElements(
	ITransientElementMaker maker
)
Public Sub MakeTransientElements (
	maker As ITransientElementMaker
)
public:
void MakeTransientElements(
	ITransientElementMaker^ maker
)
member MakeTransientElements :
        maker : ITransientElementMaker -> unit
Parameters
maker ITransientElementMaker
 An instance of a class that implements the ITransientElementMaker interface. The maker will be called to create element(s) which would become transient.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This Document has an open editing transaction and is accepting changes. -or- This Document is read-only: It cannot be modified.
Remarks
 The method establishes a context within which transient elements will be created and then invokes the given maker object to create the elements. For more information refer to the IsTransient method.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace